; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l19_p19_c19_g19_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 medicine)
	(crate-content crate8 medicine)
	(crate-content crate9 medicine)
	(crate-content crate10 medicine)
	(crate-content crate11 medicine)
	(crate-content crate12 medicine)
	(crate-content crate13 medicine)
	(crate-content crate14 medicine)
	(crate-content crate15 medicine)
	(crate-content crate16 medicine)
	(crate-content crate17 medicine)
	(crate-content crate18 medicine)
	(crate-content crate19 medicine)
	(at person1 loc9)
	(at person2 loc17)
	(at person3 loc12)
	(at person4 loc13)
	(at person5 loc16)
	(at person6 loc19)
	(at person7 loc19)
	(at person8 loc3)
	(at person9 loc18)
	(at person10 loc15)
	(at person11 loc9)
	(at person12 loc15)
	(at person13 loc15)
	(at person14 loc16)
	(at person15 loc11)
	(at person16 loc16)
	(at person17 loc4)
	(at person18 loc11)
	(at person19 loc4)
	(person-needs person1 medicine)
	(person-needs person2 medicine)
	(person-needs person3 medicine)
	(person-needs person4 food)
	(person-needs person5 medicine)
	(person-needs person6 food)
	(person-needs person7 medicine)
	(person-needs person8 food)
	(person-needs person8 medicine)
	(person-needs person10 medicine)
	(person-needs person11 medicine)
	(person-needs person12 medicine)
	(person-needs person13 food)
	(person-needs person13 medicine)
	(person-needs person14 medicine)
	(person-needs person16 food)
	(person-needs person17 medicine)
	(person-needs person19 food)
	(person-needs person19 medicine)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 medicine)
	(person-has person2 medicine)
	(person-has person3 medicine)
	(person-has person4 food)
	(person-has person5 medicine)
	(person-has person6 food)
	(person-has person7 medicine)
	(person-has person8 food)
	(person-has person8 medicine)
	(person-has person10 medicine)
	(person-has person11 medicine)
	(person-has person12 medicine)
	(person-has person13 food)
	(person-has person13 medicine)
	(person-has person14 medicine)
	(person-has person16 food)
	(person-has person17 medicine)
	(person-has person19 food)
	(person-has person19 medicine)
	))
)

; plan
1. (grab-arm2 drone1 crate6 depot)
   deleted: (arm2-free drone1) (at crate6 depot)
   added: (arm2-load drone1 crate6)
   goals met: 1 of 20
2. (grab-arm1 drone1 crate19 depot)
   deleted: (arm1-free drone1) (at crate19 depot)
   added: (arm1-load drone1 crate19)
   goals met: 1 of 20
3. (move-drone drone1 depot loc17)
   deleted: (at drone1 depot)
   added: (at drone1 loc17)
   goals met: 0 of 20
4. (deliver-arm1 drone1 person2 crate19 medicine loc17)
   deleted: (arm1-load drone1 crate19) (person-needs person2 medicine)
   added: (arm1-free drone1) (person-has person2 medicine)
   goals met: 1 of 20
5. (move-drone drone1 loc17 loc13)
   deleted: (at drone1 loc17)
   added: (at drone1 loc13)
   goals met: 1 of 20
6. (deliver-arm2 drone1 person4 crate6 food loc13)
   deleted: (arm2-load drone1 crate6) (person-needs person4 food)
   added: (arm2-free drone1) (person-has person4 food)
   goals met: 2 of 20
7. (move-drone drone1 loc13 loc12)
   deleted: (at drone1 loc13)
   added: (at drone1 loc12)
   goals met: 2 of 20
8. (move-drone drone1 loc12 depot)
   deleted: (at drone1 loc12)
   added: (at drone1 depot)
   goals met: 3 of 20
9. (grab-arm2 drone1 crate5 depot)
   deleted: (arm2-free drone1) (at crate5 depot)
   added: (arm2-load drone1 crate5)
   goals met: 3 of 20
10. (grab-arm1 drone1 crate18 depot)
   deleted: (arm1-free drone1) (at crate18 depot)
   added: (arm1-load drone1 crate18)
   goals met: 3 of 20
11. (move-drone drone1 depot loc12)
   deleted: (at drone1 depot)
   added: (at drone1 loc12)
   goals met: 2 of 20
12. (deliver-arm1 drone1 person3 crate18 medicine loc12)
   deleted: (arm1-load drone1 crate18) (person-needs person3 medicine)
   added: (arm1-free drone1) (person-has person3 medicine)
   goals met: 3 of 20
13. (move-drone drone1 loc12 loc19)
   deleted: (at drone1 loc12)
   added: (at drone1 loc19)
   goals met: 3 of 20
14. (move-drone drone1 loc19 depot)
   deleted: (at drone1 loc19)
   added: (at drone1 depot)
   goals met: 4 of 20
15. (grab-arm1 drone1 crate17 depot)
   deleted: (arm1-free drone1) (at crate17 depot)
   added: (arm1-load drone1 crate17)
   goals met: 4 of 20
16. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 3 of 20
17. (deliver-arm2 drone1 person6 crate5 food loc19)
   deleted: (arm2-load drone1 crate5) (person-needs person6 food)
   added: (arm2-free drone1) (person-has person6 food)
   goals met: 4 of 20
18. (move-drone drone1 loc19 depot)
   deleted: (at drone1 loc19)
   added: (at drone1 depot)
   goals met: 5 of 20
19. (grab-arm2 drone1 crate4 depot)
   deleted: (arm2-free drone1) (at crate4 depot)
   added: (arm2-load drone1 crate4)
   goals met: 5 of 20
20. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 4 of 20
21. (deliver-arm1 drone1 person7 crate17 medicine loc19)
   deleted: (arm1-load drone1 crate17) (person-needs person7 medicine)
   added: (arm1-free drone1) (person-has person7 medicine)
   goals met: 5 of 20
22. (move-drone drone1 loc19 loc3)
   deleted: (at drone1 loc19)
   added: (at drone1 loc3)
   goals met: 5 of 20
23. (move-drone drone1 loc3 depot)
   deleted: (at drone1 loc3)
   added: (at drone1 depot)
   goals met: 6 of 20
24. (grab-arm1 drone1 crate16 depot)
   deleted: (arm1-free drone1) (at crate16 depot)
   added: (arm1-load drone1 crate16)
   goals met: 6 of 20
25. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 5 of 20
26. (deliver-arm2 drone1 person8 crate4 food loc3)
   deleted: (arm2-load drone1 crate4) (person-needs person8 food)
   added: (arm2-free drone1) (person-has person8 food)
   goals met: 6 of 20
27. (move-drone drone1 loc3 depot)
   deleted: (at drone1 loc3)
   added: (at drone1 depot)
   goals met: 7 of 20
28. (grab-arm2 drone1 crate3 depot)
   deleted: (arm2-free drone1) (at crate3 depot)
   added: (arm2-load drone1 crate3)
   goals met: 7 of 20
29. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 6 of 20
30. (deliver-arm1 drone1 person8 crate16 medicine loc3)
   deleted: (arm1-load drone1 crate16) (person-needs person8 medicine)
   added: (arm1-free drone1) (person-has person8 medicine)
   goals met: 7 of 20
31. (move-drone drone1 loc3 loc9)
   deleted: (at drone1 loc3)
   added: (at drone1 loc9)
   goals met: 7 of 20
32. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 8 of 20
33. (grab-arm1 drone1 crate15 depot)
   deleted: (arm1-free drone1) (at crate15 depot)
   added: (arm1-load drone1 crate15)
   goals met: 8 of 20
34. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 7 of 20
35. (deliver-arm1 drone1 person1 crate15 medicine loc9)
   deleted: (arm1-load drone1 crate15) (person-needs person1 medicine)
   added: (arm1-free drone1) (person-has person1 medicine)
   goals met: 8 of 20
36. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 9 of 20
37. (grab-arm1 drone1 crate14 depot)
   deleted: (arm1-free drone1) (at crate14 depot)
   added: (arm1-load drone1 crate14)
   goals met: 9 of 20
38. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 8 of 20
39. (deliver-arm1 drone1 person11 crate14 medicine loc9)
   deleted: (arm1-load drone1 crate14) (person-needs person11 medicine)
   added: (arm1-free drone1) (person-has person11 medicine)
   goals met: 9 of 20
40. (move-drone drone1 loc9 loc15)
   deleted: (at drone1 loc9)
   added: (at drone1 loc15)
   goals met: 9 of 20
41. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 10 of 20
42. (grab-arm1 drone1 crate13 depot)
   deleted: (arm1-free drone1) (at crate13 depot)
   added: (arm1-load drone1 crate13)
   goals met: 10 of 20
43. (move-drone drone1 depot loc15)
   deleted: (at drone1 depot)
   added: (at drone1 loc15)
   goals met: 9 of 20
44. (deliver-arm1 drone1 person10 crate13 medicine loc15)
   deleted: (arm1-load drone1 crate13) (person-needs person10 medicine)
   added: (arm1-free drone1) (person-has person10 medicine)
   goals met: 10 of 20
45. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 11 of 20
46. (grab-arm1 drone1 crate12 depot)
   deleted: (arm1-free drone1) (at crate12 depot)
   added: (arm1-load drone1 crate12)
   goals met: 11 of 20
47. (move-drone drone1 depot loc15)
   deleted: (at drone1 depot)
   added: (at drone1 loc15)
   goals met: 10 of 20
48. (deliver-arm1 drone1 person12 crate12 medicine loc15)
   deleted: (arm1-load drone1 crate12) (person-needs person12 medicine)
   added: (arm1-free drone1) (person-has person12 medicine)
   goals met: 11 of 20
49. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 12 of 20
50. (grab-arm1 drone1 crate11 depot)
   deleted: (arm1-free drone1) (at crate11 depot)
   added: (arm1-load drone1 crate11)
   goals met: 12 of 20
51. (move-drone drone1 depot loc15)
   deleted: (at drone1 depot)
   added: (at drone1 loc15)
   goals met: 11 of 20
52. (deliver-arm2 drone1 person13 crate3 food loc15)
   deleted: (arm2-load drone1 crate3) (person-needs person13 food)
   added: (arm2-free drone1) (person-has person13 food)
   goals met: 12 of 20
53. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 13 of 20
54. (grab-arm2 drone1 crate2 depot)
   deleted: (arm2-free drone1) (at crate2 depot)
   added: (arm2-load drone1 crate2)
   goals met: 13 of 20
55. (move-drone drone1 depot loc15)
   deleted: (at drone1 depot)
   added: (at drone1 loc15)
   goals met: 12 of 20
56. (deliver-arm1 drone1 person13 crate11 medicine loc15)
   deleted: (arm1-load drone1 crate11) (person-needs person13 medicine)
   added: (arm1-free drone1) (person-has person13 medicine)
   goals met: 13 of 20
57. (move-drone drone1 loc15 loc16)
   deleted: (at drone1 loc15)
   added: (at drone1 loc16)
   goals met: 13 of 20
58. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 14 of 20
59. (grab-arm1 drone1 crate10 depot)
   deleted: (arm1-free drone1) (at crate10 depot)
   added: (arm1-load drone1 crate10)
   goals met: 14 of 20
60. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 13 of 20
61. (deliver-arm1 drone1 person5 crate10 medicine loc16)
   deleted: (arm1-load drone1 crate10) (person-needs person5 medicine)
   added: (arm1-free drone1) (person-has person5 medicine)
   goals met: 14 of 20
62. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 15 of 20
63. (grab-arm1 drone1 crate9 depot)
   deleted: (arm1-free drone1) (at crate9 depot)
   added: (arm1-load drone1 crate9)
   goals met: 15 of 20
64. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 14 of 20
65. (deliver-arm1 drone1 person14 crate9 medicine loc16)
   deleted: (arm1-load drone1 crate9) (person-needs person14 medicine)
   added: (arm1-free drone1) (person-has person14 medicine)
   goals met: 15 of 20
66. (deliver-arm2 drone1 person16 crate2 food loc16)
   deleted: (arm2-load drone1 crate2) (person-needs person16 food)
   added: (arm2-free drone1) (person-has person16 food)
   goals met: 16 of 20
67. (move-drone drone1 loc16 loc4)
   deleted: (at drone1 loc16)
   added: (at drone1 loc4)
   goals met: 16 of 20
68. (move-drone drone1 loc4 depot)
   deleted: (at drone1 loc4)
   added: (at drone1 depot)
   goals met: 17 of 20
69. (grab-arm2 drone1 crate1 depot)
   deleted: (arm2-free drone1) (at crate1 depot)
   added: (arm2-load drone1 crate1)
   goals met: 17 of 20
70. (grab-arm1 drone1 crate8 depot)
   deleted: (arm1-free drone1) (at crate8 depot)
   added: (arm1-load drone1 crate8)
   goals met: 17 of 20
71. (move-drone drone1 depot loc4)
   deleted: (at drone1 depot)
   added: (at drone1 loc4)
   goals met: 16 of 20
72. (deliver-arm2 drone1 person19 crate1 food loc4)
   deleted: (arm2-load drone1 crate1) (person-needs person19 food)
   added: (arm2-free drone1) (person-has person19 food)
   goals met: 17 of 20
73. (deliver-arm1 drone1 person17 crate8 medicine loc4)
   deleted: (arm1-load drone1 crate8) (person-needs person17 medicine)
   added: (arm1-free drone1) (person-has person17 medicine)
   goals met: 18 of 20
74. (move-drone drone1 loc4 depot)
   deleted: (at drone1 loc4)
   added: (at drone1 depot)
   goals met: 19 of 20
75. (grab-arm2 drone1 crate7 depot)
   deleted: (arm2-free drone1) (at crate7 depot)
   added: (arm2-load drone1 crate7)
   goals met: 19 of 20
76. (move-drone drone1 depot loc4)
   deleted: (at drone1 depot)
   added: (at drone1 loc4)
   goals met: 18 of 20
77. (deliver-arm2 drone1 person19 crate7 medicine loc4)
   deleted: (arm2-load drone1 crate7) (person-needs person19 medicine)
   added: (arm2-free drone1) (person-has person19 medicine)
   goals met: 19 of 20
78. (move-drone drone1 loc4 depot)
   deleted: (at drone1 loc4)
   added: (at drone1 depot)
   goals met: 20 of 20
